org/_posts/2019-06-23-sicp-chapter-3.org
#+BEGIN_EXPORT html
---
layout: page
title: SICP Chapter 3 Exercises & Solutions
excerpt: SICP Chapter 3
category: note
tags:
- sicp
- lisp
- exercises
- solutions
---
#+END_EXPORT
#+HTML_DOCTYPE: html5
#+OPTIONS: H:3

* 
  The HTML for this page has been automatically generated by parsing the loosely
  formatted source code & comments included in my solutions repository
  ([[https://github.com/zv/SICP-guile]]), if you encounter any unformatted
  solutions, you think you've spotted an error or you have something you'd like
  to share about the exercises, don't hesitate to leave a comment below
  (or a pull request on the source repo).
  
* Exercises Chapter 3

** Exercise 3.1
   #+begin_quote
   An accumulator is a procedure that is called repeatedly with a single numeric
   argument and accumulates its arguments into a sum. Each time it is called, it
   returns the currently accumulated sum. Write a procedure make-accumulator that
   generates accumulators, each maintaining an independent sum. The input to
   make-accumulator should specify the initial value of the sum;

   (define A (make-accumulator 5)) 
   #+end_quote
*** Answer
    #+begin_src scheme
      (define (make-accumulator x)
        (lambda (n)
          (+ x n)))
    #+end_src

** Exercise 3.2
   #+begin_quote
   In software-testing applications, it is useful to be able to count
   the number of times a given procedure is called during the course of a
   computation. Write a procedure make-monitored that takes as input a procedure,
   f, that itself takes one input. The result returned by make-monitored is a third
   procedure, say mf, that keeps track of the number of times it has been called by
   maintaining an internal counter. If the input to mf is the special symbol
   how-many-calls?, then mf returns the value of the counter. If the input is the
   special symbol reset-count, then mf resets the counter to zero. For any other
   input, mf returns the result of calling f on that input and increments the
   counter. For instance, we could make a monitored version of the sqrt procedure: 
   #+end_quote
*** Answer
    #+begin_src scheme
      (define (make-monitored f)
        (define calls 0)
        (lambda (n)
          (if (eq? n 'how-many-calls?)
              calls
              (begin
                (set! calls (inc calls))
                (f n)))))
    #+end_src
    
*** Exercise 3.3
    #+begin_quote
    Modify the make-account procedure so that it creates password-protected
    accounts. That is, make-account should take a symbol as an additional argument,
    as in
    #+end_quote
*** Answer
    #+begin_src scheme
(define 3.3/acc (make-account 100 'secret-password))
(define (3.3/make-account acct# passwd)
  (define (withdraw amount)
    (if (>= balance amount)
        (begin (set! balance
                     (- balance amount))
               balance)
        "Insufficient funds"))
  (define (deposit amount)
    (set! balance (+ balance amount))
    balance)
  (define (dispatch m)
    (cond ((eq? m 'withdraw) withdraw)
          ((eq? m 'deposit) deposit)
          (else (error "Unknown request:
                 MAKE-ACCOUNT" m))))
  dispatch)
    #+end_src

