_posts/2019-06-23-sicp-chapter-3.html
---
layout: page
title: SICP Chapter 3 Exercises & Solutions
excerpt: SICP Chapter 3
category: note
tags:
- sicp
- lisp
- exercises
- solutions
---

<section id="outline-container-orgbcc721f" class="outline-2">
<h2 id="orgbcc721f"></h2>
<div class="outline-text-2" id="text-orgbcc721f">
<p>
The HTML for this page has been automatically generated by parsing the loosely
formatted source code &amp; comments included in my solutions repository
(<a href="https://github.com/zv/SICP-guile">https://github.com/zv/SICP-guile</a>), if you encounter any unformatted
solutions, you think you've spotted an error or you have something you'd like
to share about the exercises, don't hesitate to leave a comment below
(or a pull request on the source repo).
</p>
</div>
</section>

<section id="outline-container-org61e63ee" class="outline-2">
<h2 id="org61e63ee">Exercises Chapter 3</h2>
<div class="outline-text-2" id="text-org61e63ee">
</div>
<div id="outline-container-org2f2b3ae" class="outline-3">
<h3 id="org2f2b3ae">Exercise 3.1</h3>
<div class="outline-text-3" id="text-org2f2b3ae">
<blockquote>
<p>
An accumulator is a procedure that is called repeatedly with a single numeric
argument and accumulates its arguments into a sum. Each time it is called, it
returns the currently accumulated sum. Write a procedure make-accumulator that
generates accumulators, each maintaining an independent sum. The input to
make-accumulator should specify the initial value of the sum;
</p>

<p>
(define A (make-accumulator 5)) 
</p>
</blockquote>
</div>
<div id="outline-container-org51f5812" class="outline-4">
<h4 id="org51f5812">Answer</h4>
<div class="outline-text-4" id="text-org51f5812">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-accumulator</span> x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>+ x n<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge49ea7d" class="outline-3">
<h3 id="orge49ea7d">Exercise 3.2</h3>
<div class="outline-text-3" id="text-orge49ea7d">
<blockquote>
<p>
In software-testing applications, it is useful to be able to count
the number of times a given procedure is called during the course of a
computation. Write a procedure make-monitored that takes as input a procedure,
f, that itself takes one input. The result returned by make-monitored is a third
procedure, say mf, that keeps track of the number of times it has been called by
maintaining an internal counter. If the input to mf is the special symbol
how-many-calls?, then mf returns the value of the counter. If the input is the
special symbol reset-count, then mf resets the counter to zero. For any other
input, mf returns the result of calling f on that input and increments the
counter. For instance, we could make a monitored version of the sqrt procedure: 
</p>
</blockquote>
</div>
<div id="outline-container-org4da7496" class="outline-4">
<h4 id="org4da7496">Answer</h4>
<div class="outline-text-4" id="text-org4da7496">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-monitored</span> f<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">calls</span> <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>eq? n 'how-many-calls?<span style="color: #6c71c4;">)</span>
        calls
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">begin</span>
          <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">set!</span> calls <span style="color: #b58900;">(</span>inc calls<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>f n<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org72121ad" class="outline-4">
<h4 id="org72121ad">Exercise 3.3</h4>
<div class="outline-text-4" id="text-org72121ad">
<blockquote>
<p>
Modify the make-account procedure so that it creates password-protected
accounts. That is, make-account should take a symbol as an additional argument,
as in
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd6dfdbf" class="outline-4">
<h4 id="orgd6dfdbf">Answer</h4>
<div class="outline-text-4" id="text-orgd6dfdbf">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">3.3/acc</span> <span style="color: #b58900;">(</span>make-account <span style="color: #6c71c4;">100</span> 'secret-password<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">3.3/make-account</span> acct# passwd<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">withdraw</span> amount<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>&gt;= balance amount<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">begin</span> <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">set!</span> balance
                     <span style="color: #b58900;">(</span>- balance amount<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
               balance<span style="color: #6c71c4;">)</span>
        <span style="color: #2aa198;">"Insufficient funds"</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">deposit</span> amount<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">set!</span> balance <span style="color: #6c71c4;">(</span>+ balance amount<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    balance<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">dispatch</span> m<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>eq? m 'withdraw<span style="color: #859900;">)</span> withdraw<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>eq? m 'deposit<span style="color: #859900;">)</span> deposit<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900;">(</span>error <span style="color: #2aa198;">"Unknown request:</span>
<span style="color: #2aa198;">                 MAKE-ACCOUNT"</span> m<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  dispatch<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
