_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-org6df9d12" class="outline-3">
<h3 id="org6df9d12">Exercise 3.5</h3>
<div class="outline-text-3" id="text-org6df9d12">
<blockquote>
<p>
Monte Carlo integration is a method of estimating definite integrals by means of
Monte Carlo simulation. Consider computing the area of a region of space
described by a predicate p ( x , y ) that is true for points ( x , y ) in the
region and #f for points not in the region. For example, the region contained
within a circle of radius 3 centered at (5, 7) is described by the predicate
that tests whether ( x − 5 ) 2 + ( y − 7 ) 2 ≤ 3 2 . To estimate the area of the
region described by such a predicate, begin by choosing a rectangle that
contains the region. For example, a rectangle with diagonally opposite corners
at (2, 4) and (8, 10) contains the circle above. The desired integral is the
area of that portion of the rectangle that lies in the region. We can estimate
the integral by picking, at random, points ( x , y ) that lie in the rectangle,
and testing p ( x , y ) for each point to determine whether the point lies in
the region. If we try this with many points, then the fraction of points that
fall in the region should give an estimate of the proportion of the rectangle
that lies in the region. Hence, multiplying this fraction by the area of the
entire rectangle should produce an estimate of the integral.
</p>

<p>
Implement Monte Carlo integration as a procedure estimate-integral that takes as
arguments a predicate p, upper and lower bounds x1, x2, y1, and y2 for the
rectangle, and the number of trials to perform in order to produce the estimate.
Your procedure should use the same monte-carlo procedure that was used above to
estimate π . Use your estimate-integral to produce an estimate of π by measuring
the area of a unit circle.
</p>

<p>
You will find it useful to have a procedure that returns a number chosen at
random from a given range. The following random-in-range procedure implements
this in terms of the random procedure used in 1.2.6, which returns a nonnegative
number less than its input.136 
</p>
</blockquote>
</div>
<div id="outline-container-orgc717ddc" class="outline-4">
<h4 id="orgc717ddc">Answer</h4>
<div class="outline-text-4" id="text-orgc717ddc">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">random-in-range</span> low high<span style="color: #b58900;">)</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">had to write my own</span>
  <span style="color: #b58900;">(</span>+ low <span style="color: #268bd2;">(</span>random high<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">estimate-integral</span> p x1 x2 y1 y2 trials<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">width</span> <span style="color: #268bd2;">(</span>abs <span style="color: #6c71c4;">(</span>- x2 x1<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">height</span> <span style="color: #268bd2;">(</span>abs <span style="color: #6c71c4;">(</span>- y2 y1<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">area</span> <span style="color: #268bd2;">(</span>* width height<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">iter</span> remaining passed<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>x <span style="color: #b58900;">(</span>random-in-range x1 x2<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
           <span style="color: #859900;">(</span>y <span style="color: #b58900;">(</span>random-in-range y1 y2<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
           <span style="color: #859900;">(</span>is-contained? <span style="color: #b58900;">(</span>p x y<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>= remaining <span style="color: #6c71c4;">0</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>/ passed trials<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span>is-contained? <span style="color: #b58900;">(</span>iter <span style="color: #268bd2;">(</span>dec remaining<span style="color: #268bd2;">)</span>
                                 <span style="color: #268bd2;">(</span>inc passed<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">else</span>
             <span style="color: #b58900;">(</span>iter <span style="color: #268bd2;">(</span>dec remaining<span style="color: #268bd2;">)</span> passed<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>* area
     <span style="color: #268bd2;">(</span>iter trials <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">unit-circle-pred</span> x y<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>&lt;= <span style="color: #268bd2;">(</span>+ <span style="color: #6c71c4;">(</span>* x x<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>* y y<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org524e63e" class="outline-3">
<h3 id="org524e63e">Exercise 3.6</h3>
<div class="outline-text-3" id="text-org524e63e">
<blockquote>
<p>

</p>

<p>
It is useful to be able to reset a random-number generator to produce a sequence
starting from a given value. Design a new rand procedure that is called with an
argument that is either the symbol generate or the symbol reset and behaves as
follows: (rand 'generate) produces a new random number; ((rand 'reset)
⟨new-value⟩) resets the internal state variable to the designated ⟨new-value⟩.
Thus, by resetting the state, one can generate repeatable sequences. These are
very handy to have when testing and debugging programs that use random numbers. 
</p>
</blockquote>
</div>
<div id="outline-container-orga08d58f" class="outline-4">
<h4 id="orga08d58f">Answer</h4>
<div class="outline-text-4" id="text-orga08d58f">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">This is what I assume he meant??</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">rand</span> command<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">case</span> command
    <span style="color: #268bd2;">(</span>'generate <span style="color: #6c71c4;">(</span>random <span style="color: #6c71c4;">10</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>new<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>seed-&gt;random-state new<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Utilities</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">count-pairs</span> x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>not <span style="color: #6c71c4;">(</span>pair? x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #6c71c4;">0</span>
      <span style="color: #268bd2;">(</span>+ <span style="color: #6c71c4;">(</span>count-pairs <span style="color: #859900;">(</span>car x<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>count-pairs <span style="color: #859900;">(</span>cdr x<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(define (append! x y)</span>
<span style="color: #93a1a1;">;;   </span><span style="color: #93a1a1;">(set-cdr! (last-pair x) y)</span>
<span style="color: #93a1a1;">;;   </span><span style="color: #93a1a1;">x)</span>

</pre>
</div>
</div>
</div>
</div>
