org/_posts/2019-06-23-sicp-chapter-3.org
** Exercise 3.12: The following procedure for appending lists was introduced in 2.2.1:
   #+begin_quote
(define (append x y)
(if (null? x)
y
(cons (car x) (append (cdr x) y))))

Append forms a new list by successively consing the elements of x onto y. The
procedure append! is similar to append, but it is a mutator rather than a
constructor. It appends the lists by splicing them together, modifying the final
pair of x so that its cdr is now y. (It is an error to call append! with an
empty x.)

   #+end_quote
*** Answer
    #+begin_src scheme

      (define (last-pair x)
        (if (null? (cdr x))
            x
            (last-pair (cdr x))))

      (define x (list 'a 'b))
      (define y (list 'c 'd))
      (define z (append x y))

      ;; Exercise 3.13
      ;; What happens if we try to compute (last-pair z)?
      (define (make-cycle x)
        (set-cdr! (last-pair x) x)
        x)

      ;;; Answer: An infinite loop occurs (a cycle in the linked list has been made)
    #+end_src

** Exercise 3.14: The following procedure is quite useful, although obscure:
   #+begin_quote

   #+end_quote
*** Answer
    #+begin_src scheme
      (define (mystery x)
        (define (loop x y)
          (if (null? x)
              y
              (let ((temp (cdr x)))
                (set-cdr! x y)
                (loop temp x))))
        (loop x '()))

      #|
      Loop uses the “temporary” variable temp to hold the old value of the cdr of x,
      since the set-cdr! on the next line destroys the cdr. Explain what mystery does
      in general. Suppose v is defined by (define v (list 'a 'b 'c 'd)). Draw the
      box-and-pointer diagram that represents the list to which v is bound. Suppose
      that we now evaluate (define w (mystery v)). Draw box-and-pointer diagrams that
      show the structures v and w after evaluating this expression. What would be
      printed as the values of v and w?
      |#

      #|
      Answer:

      Mystery reverses an array "in-place"
      |#
    #+end_src

** Exercise 3.16
   #+begin_quote
    Ben Bitdiddle decides to write a procedure to count the number of pairs in any
    list structure. “It’s easy,” he reasons. “The number of pairs in any structure
    is the number in the car plus the number in the cdr plus one more to count the
    current pair.” So Ben writes the following procedure:

      (define (count-pairs x)
        (if (not (pair? x))
            0
            (+ (count-pairs (car x))
              (count-pairs (cdr x))
              1)))

    Show that this procedure is not correct. In particular, draw box-and-pointer
    diagrams representing list structures made up of exactly three pairs for which
    Ben’s procedure would return 3; return 4; return 7; never return at all.
    #+end_quote
    
*** Answer
    #+begin_src scheme
      (define count-three-pairs '(a b c))
      (define count-four-pairs '(a b c))
      (define count-seven-pairs '(a b c))
      (set-car! (cdr count-four-pairs) (cdr (cdr count-four-pairs)))
      (set-car! count-seven-pairs (cdr count-seven-pairs))

      #|
      Answer:
      (count-pairs count-three-pairs) => 3
      (count-pairs count-four-pairs)  => 4
      (count-pairs count-seven-pairs) => 7
      |#
    #+end_src

** Exercise 3.17
   #+begin_quote
    Devise a correct version of the count-pairs procedure of Exercise 3.16 that
    returns the number of distinct pairs in any structure.

    (Hint: Traverse the structure, maintaining an auxiliary data structure that is
    used to keep track of which pairs have already been counted.)
   #+end_quote

