_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-orgcf76e71" class="outline-3">
<h3 id="orgcf76e71">Exercise 3.12: The following procedure for appending lists was introduced in 2.2.1:</h3>
<div class="outline-text-3" id="text-orgcf76e71">
<blockquote>
<p>
(define (append x y)
(if (null? x)
y
(cons (car x) (append (cdr x) y))))
</p>

<p>
Append forms a new list by successively consing the elements of x onto y. The
procedure append! is similar to append, but it is a mutator rather than a
constructor. It appends the lists by splicing them together, modifying the final
pair of x so that its cdr is now y. (It is an error to call append! with an
empty x.)
</p>
</blockquote>
</div>
<div id="outline-container-org52a4075" class="outline-4">
<h4 id="org52a4075">Answer</h4>
<div class="outline-text-4" id="text-org52a4075">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">last-pair</span> x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? <span style="color: #6c71c4;">(</span>cdr x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
      x
      <span style="color: #268bd2;">(</span>last-pair <span style="color: #6c71c4;">(</span>cdr x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">x</span> <span style="color: #b58900;">(</span>list 'a 'b<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">y</span> <span style="color: #b58900;">(</span>list 'c 'd<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">z</span> <span style="color: #b58900;">(</span>append x y<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Exercise 3.13</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">What happens if we try to compute (last-pair z)?</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-cycle</span> x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set-cdr! <span style="color: #268bd2;">(</span>last-pair x<span style="color: #268bd2;">)</span> x<span style="color: #b58900;">)</span>
  x<span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;;; </span><span style="color: #93a1a1;">Answer: An infinite loop occurs (a cycle in the linked list has been made)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org29f1c54" class="outline-3">
<h3 id="org29f1c54">Exercise 3.14: The following procedure is quite useful, although obscure:</h3>
<div class="outline-text-3" id="text-org29f1c54">
<blockquote>
<p>

</p>
</blockquote>
</div>
<div id="outline-container-org4815551" class="outline-4">
<h4 id="org4815551">Answer</h4>
<div class="outline-text-4" id="text-org4815551">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">mystery</span> x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">loop</span> x y<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>null? x<span style="color: #6c71c4;">)</span>
        y
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>temp <span style="color: #268bd2;">(</span>cdr x<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>set-cdr! x y<span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>loop temp x<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>loop x '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">Loop uses the &#8220;temporary&#8221; variable temp to hold the old value of the cdr of x,</span>
<span style="color: #93a1a1;">since the set-cdr! on the next line destroys the cdr. Explain what mystery does</span>
<span style="color: #93a1a1;">in general. Suppose v is defined by (define v (list 'a 'b 'c 'd)). Draw the</span>
<span style="color: #93a1a1;">box-and-pointer diagram that represents the list to which v is bound. Suppose</span>
<span style="color: #93a1a1;">that we now evaluate (define w (mystery v)). Draw box-and-pointer diagrams that</span>
<span style="color: #93a1a1;">show the structures v and w after evaluating this expression. What would be</span>
<span style="color: #93a1a1;">printed as the values of v and w?</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">Answer:</span>

<span style="color: #93a1a1;">Mystery reverses an array "in-place"</span>
<span style="color: #93a1a1;">|#</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf758043" class="outline-3">
<h3 id="orgf758043">Exercise 3.16</h3>
<div class="outline-text-3" id="text-orgf758043">
<blockquote>
<p>
Ben Bitdiddle decides to write a procedure to count the number of pairs in any
list structure. “It’s easy,” he reasons. “The number of pairs in any structure
is the number in the car plus the number in the cdr plus one more to count the
current pair.” So Ben writes the following procedure:
</p>

<p>
(define (count-pairs x)
  (if (not (pair? x))
      0
      (+ (count-pairs (car x))
        (count-pairs (cdr x))
        1)))
</p>

<p>
Show that this procedure is not correct. In particular, draw box-and-pointer
diagrams representing list structures made up of exactly three pairs for which
Ben’s procedure would return 3; return 4; return 7; never return at all.
</p>
</blockquote>
</div>

<div id="outline-container-org77b2240" class="outline-4">
<h4 id="org77b2240">Answer</h4>
<div class="outline-text-4" id="text-org77b2240">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">count-three-pairs</span> '<span style="color: #b58900;">(</span>a b c<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">count-four-pairs</span> '<span style="color: #b58900;">(</span>a b c<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">count-seven-pairs</span> '<span style="color: #b58900;">(</span>a b c<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>set-car! <span style="color: #b58900;">(</span>cdr count-four-pairs<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>cdr <span style="color: #268bd2;">(</span>cdr count-four-pairs<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>set-car! count-seven-pairs <span style="color: #b58900;">(</span>cdr count-seven-pairs<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">Answer:</span>
<span style="color: #93a1a1;">(count-pairs count-three-pairs) =&gt; 3</span>
<span style="color: #93a1a1;">(count-pairs count-four-pairs)  =&gt; 4</span>
<span style="color: #93a1a1;">(count-pairs count-seven-pairs) =&gt; 7</span>
<span style="color: #93a1a1;">|#</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1524625" class="outline-3">
<h3 id="org1524625">Exercise 3.17</h3>
<div class="outline-text-3" id="text-org1524625">
<blockquote>
<p>
Devise a correct version of the count-pairs procedure of Exercise 3.16 that
returns the number of distinct pairs in any structure.
</p>

<p>
(Hint: Traverse the structure, maintaining an auxiliary data structure that is
used to keep track of which pairs have already been counted.)
</p>
</blockquote>
</div>
