org/_posts/2019-06-23-sicp-chapter-3.org
*** Answer   
    #+begin_src scheme
(define (zv-count-pairs xs)
  (define counted '())
  (define (loop xs)
    (cond ((not (pair? xs)) 1)
          ((null? xs) 0)
          ((memq (car xs) counted) 0)
          (else
           (begin
             (set! counted (cons (car xs) counted))
             (+ (loop (car xs))
                (loop (cdr xs)))))))
  (loop xs))

    #+end_src

** Exercise 3.18
   #+begin_quote
   Write a procedure that examines a list and determines whether it contains a
   cycle, that is, whether a program that tried to find the end of the list by
   taking successive cdrs would go into an infinite loop. Exercise 3.13 constructed
   such lists.

   #+end_quote
*** Answer
    #+begin_src scheme
      (define (has-cycles? xs)
        (define visited '())
        (define (search ys)
          (cond ((null? ys) #f)
                ((memq (car ys) visited) #t)
                (else
                 (begin
                   (set! visited (cons (car ys) visited))
                   (search (cdr ys))))))
        (search xs))

    #+end_src

** Exercise 3.19
   #+begin_quote
   Redo Exercise 3.18 using an algorithm that takes only a constant amount of
   space. (This requires a very clever idea.)

   #+end_quote
*** Answer
    #+begin_src scheme
    (define* (linear-cycle-search x1
    #:optional (x2 (cdr x1)))
    (cond ((or (null? (cdr x1)) (null? (cdr x2))) #f)
    ((eq? x1 x2) #t)
    (else (linear-cycle-search (cdr x1) (cdr (cdr x2))))))
    #+end_src

** Exercise 3.21
   #+begin_quote
   Ben Bitdiddle decides to test the queue implementation described above. He types
   in the procedures to the Lisp interpreter and proceeds to try them out:
   
   “It’s all wrong!” he complains. “The interpreter’s response shows that the last
   item is inserted into the queue twice. And when I delete both items, the second
   b is still there, so the queue isn’t empty, even though it’s supposed to be.”
   Eva Lu Ator suggests that Ben has misunderstood what is happening. “It’s not
   that the items are going into the queue twice,” she explains. “It’s just that
   the standard Lisp printer doesn’t know how to make sense of the queue
   representation. If you want to see the queue printed correctly, you’ll have to
   define your own print procedure for queues.” Explain what Eva Lu is talking
   about. In particular, show why Ben’s examples produce the printed results that
   they do. Define a procedure print-queue that takes a queue as input and prints
   the sequence of items in the queue.
    #+end_quote
   
*** Answer
    #+begin_src scheme
    (define (print-queue qs)
    (format #t "~a~%" (car qs)))
    #+end_src#+end_src

** Exercise 3.22
   #+begin_quote
    Instead of representing a queue as a pair of pointers, we can build a queue as a
    procedure with local state. The local state will consist of pointers to the
    beginning and the end of an ordinary list. Thus, the make-queue procedure will
    have the form

    (define (make-queue)
    (let ((front-ptr … )
    (rear-ptr … ))
    ⟨definitions of internal procedures⟩
    (define (dispatch m) …)
    dispatch))

    Complete the definition of make-queue and provide implementations of the queue
    operations using this representation.
   #+end_quote

