_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-org1dda1c7" class="outline-4">
<h4 id="org1dda1c7">Answer</h4>
<div class="outline-text-4" id="text-org1dda1c7">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">zv-count-pairs</span> xs<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">counted</span> '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">loop</span> xs<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>not <span style="color: #b58900;">(</span>pair? xs<span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>null? xs<span style="color: #859900;">)</span> <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>memq <span style="color: #b58900;">(</span>car xs<span style="color: #b58900;">)</span> counted<span style="color: #859900;">)</span> <span style="color: #6c71c4;">0</span><span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">else</span>
           <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">begin</span>
             <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">set!</span> counted <span style="color: #268bd2;">(</span>cons <span style="color: #6c71c4;">(</span>car xs<span style="color: #6c71c4;">)</span> counted<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
             <span style="color: #b58900;">(</span>+ <span style="color: #268bd2;">(</span>loop <span style="color: #6c71c4;">(</span>car xs<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
                <span style="color: #268bd2;">(</span>loop <span style="color: #6c71c4;">(</span>cdr xs<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>loop xs<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3ac3b1f" class="outline-3">
<h3 id="org3ac3b1f">Exercise 3.18</h3>
<div class="outline-text-3" id="text-org3ac3b1f">
<blockquote>
<p>
Write a procedure that examines a list and determines whether it contains a
cycle, that is, whether a program that tried to find the end of the list by
taking successive cdrs would go into an infinite loop. Exercise 3.13 constructed
such lists.
</p>
</blockquote>
</div>
<div id="outline-container-org47783ce" class="outline-4">
<h4 id="org47783ce">Answer</h4>
<div class="outline-text-4" id="text-org47783ce">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">has-cycles?</span> xs<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">visited</span> '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">search</span> ys<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>null? ys<span style="color: #859900;">)</span> #f<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>memq <span style="color: #b58900;">(</span>car ys<span style="color: #b58900;">)</span> visited<span style="color: #859900;">)</span> #t<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">else</span>
           <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">begin</span>
             <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">set!</span> visited <span style="color: #268bd2;">(</span>cons <span style="color: #6c71c4;">(</span>car ys<span style="color: #6c71c4;">)</span> visited<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
             <span style="color: #b58900;">(</span>search <span style="color: #268bd2;">(</span>cdr ys<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>search xs<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6730a32" class="outline-3">
<h3 id="org6730a32">Exercise 3.19</h3>
<div class="outline-text-3" id="text-org6730a32">
<blockquote>
<p>
Redo Exercise 3.18 using an algorithm that takes only a constant amount of
space. (This requires a very clever idea.)
</p>
</blockquote>
</div>
<div id="outline-container-org9e82f2c" class="outline-4">
<h4 id="org9e82f2c">Answer</h4>
<div class="outline-text-4" id="text-org9e82f2c">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define*</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">linear-cycle-search</span> x1
<span style="color: #657b83; font-weight: bold;">#:optional</span> <span style="color: #268bd2;">(</span>x2 <span style="color: #6c71c4;">(</span>cdr x1<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">or</span> <span style="color: #859900;">(</span>null? <span style="color: #b58900;">(</span>cdr x1<span style="color: #b58900;">)</span><span style="color: #859900;">)</span> <span style="color: #859900;">(</span>null? <span style="color: #b58900;">(</span>cdr x2<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span> #f<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>eq? x1 x2<span style="color: #6c71c4;">)</span> #t<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #6c71c4;">(</span>linear-cycle-search <span style="color: #859900;">(</span>cdr x1<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>cdr <span style="color: #b58900;">(</span>cdr x2<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org930015e" class="outline-3">
<h3 id="org930015e">Exercise 3.21</h3>
<div class="outline-text-3" id="text-org930015e">
<blockquote>
<p>
Ben Bitdiddle decides to test the queue implementation described above. He types
in the procedures to the Lisp interpreter and proceeds to try them out:
</p>

<p>
“It’s all wrong!” he complains. “The interpreter’s response shows that the last
item is inserted into the queue twice. And when I delete both items, the second
b is still there, so the queue isn’t empty, even though it’s supposed to be.”
Eva Lu Ator suggests that Ben has misunderstood what is happening. “It’s not
that the items are going into the queue twice,” she explains. “It’s just that
the standard Lisp printer doesn’t know how to make sense of the queue
representation. If you want to see the queue printed correctly, you’ll have to
define your own print procedure for queues.” Explain what Eva Lu is talking
about. In particular, show why Ben’s examples produce the printed results that
they do. Define a procedure print-queue that takes a queue as input and prints
the sequence of items in the queue.
</p>
</blockquote>
</div>

<div id="outline-container-org5612578" class="outline-4">
<h4 id="org5612578">Answer</h4>
<div class="outline-text-4" id="text-org5612578">
<p>
#+begin<sub>src</sub> scheme
(define (print-queue qs)
(format #t "~a~%" (car qs)))
#+end<sub>src</sub>#+end<sub>src</sub>
</p>
</div>
</div>
</div>

<div id="outline-container-orgd1e9284" class="outline-3">
<h3 id="orgd1e9284">Exercise 3.22</h3>
<div class="outline-text-3" id="text-orgd1e9284">
<blockquote>
<p>
Instead of representing a queue as a pair of pointers, we can build a queue as a
procedure with local state. The local state will consist of pointers to the
beginning and the end of an ordinary list. Thus, the make-queue procedure will
have the form
</p>

<p>
(define (make-queue)
(let ((front-ptr … )
(rear-ptr … ))
⟨definitions of internal procedures⟩
(define (dispatch m) …)
dispatch))
</p>

<p>
Complete the definition of make-queue and provide implementations of the queue
operations using this representation.
</p>
</blockquote>
</div>
