org/_posts/2019-06-23-sicp-chapter-3.org
*** Answer  
    #+begin_src scheme
     (define (make-curryq)
     (let ((front-ptr '())
     (rear-ptr '()))
     (define (set-fptr! item) (set! front-ptr item))
     (define (set-rptr! item) (set! rear-ptr item))
     (define (empty-curryq?)
     (null? front-ptr))
     (define (front-curryq)
     (if (empty-curryq?)
     (error "FRONT on empty queue")
     (car front-ptr)))
     (define (insert-curryq! item)
     (let ((new-pair (cons item '())))
     (cond [(empty-curryq?)
     (set-fptr! item)
     (set-rptr! item)]
     [else
     (set! rear-ptr new-pair)
     (set-rptr! new-pair)])))
     (define (print-queue)
     (format #t "~a~%" front-ptr))
     (define (dispatch m)
     (cond [(eq? m 'front-ptr) front-ptr]
     [(eq? m 'rear-ptr) rear-ptr]
     [(eq? m 'insert-queue!) insert-curryq!]
     [(eq? m 'print-queue) print-queue]))
     dispatch))
    #+end_src

** Exercise 3.23
   #+begin_quote
   A deque (“double-ended queue”) is a sequence in which items can be inserted and
   deleted at either the front or the rear. Operations on deques are the
   constructor make-deque, the predicate empty-deque?, selectors front-deque and
   rear-deque, and mutators front-insert-deque!, rear-insert-deque!,
   front-delete-deque!, rear-delete-deque!. Show how to represent deques using
   pairs, and give implementations of the operations. All operations should be
   accomplished in Θ(1) steps.
   #+end_quote
   
*** Answer
    #+begin_src scheme
** Structure:
   #+begin_quote
   This is the structure I've decided to use for the deque. There may be other
   neat ways to encode a deque with cons-cells. I'd love to hear if anyone has
   a better structure:

   F: Front Ptr
   B: Back Ptr
   X: Value
   /: Null or End

   +---+---+
   | F | B |-----------------+
   +-|-+---+                 |
   V                       V
   +-+-+---+   +---+---+   +-+-+---+
   | * | * |-->| * | * |-->| * | / |
   +-|-+---+   +-|-+---+   +-|-+---+
   V   ^---+   V   ^---+   V
   +-+-+---+ | +---+---+ | +---+---+
   | X | / | | | X | * | | | X | * |
   +---+---+ | +---+-+-+ | +---+-+-+
   |       |   |       |
   +-------+   +-------+

    (define (make-deque) '(() . ()))
    (define (empty-deque? dq) (null? (front-deque dq)))
    (define (front-deque dq) (car dq))
    (define (rear-deque dq) (cdr dq))
    (define (next-deque lst) (if (null? lst) '() (cdr lst)))
    (define (prev-deque lst) (if (null? lst) '() (cdar lst)))

    (define (front-insert-deque! dq value)
    (let ([new-elt (cons (cons value '()) '())])
    (cond
    ((empty-deque? dq)
    (set-car! dq new-elt) (set-cdr! dq new-elt)
    dq)
    (else
    ;; link our next element to the current front
    (set-cdr! new-elt (front-deque dq))
    ;; find the next element to make a backwards link
    (set-cdr! (car (front-deque dq)) new-elt)
    (set-car! dq new-elt)
    dq))))

    (define (rear-insert-deque! dq value)
    (let ([new-elt (cons (cons value '()) '())])
    (cond
    ((empty-deque? dq)
    (set-car! dq new-elt) (set-cdr! dq new-elt)
    dq)
    (else
    ;; Link our backwards element
    (set-cdr! (car new-elt) (rear-deque dq))
    (set-cdr! (rear-deque dq) new-elt)
    (set-cdr! dq new-elt)
    dq))))

    (define (front-delete-deque! dq)
    (let ([next (next-deque (front-deque dq))]
    [front (front-deque dq)])
    (cond
    ((null? next) (set-car! dq '()) (set-cdr! dq '()))
    (else
    (set-car! dq next)
    (set-cdr! (car (front-deque dq)) '())))
    front))

    (define (rear-delete-deque! dq)
    (let ([rear (rear-deque dq)]
    [prev (prev-deque (rear-deque dq))])
    (cond
    ((null? rear) (set-car! dq '()) (set-cdr! dq '()))
    (else
    (set-cdr! dq prev)
    (set-cdr! (rear-deque dq) '())))
    rear))
    #+end_src

