_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-org6cbf4e5" class="outline-4">
<h4 id="org6cbf4e5">Answer</h4>
<div class="outline-text-4" id="text-org6cbf4e5">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-curryq</span><span style="color: #b58900;">)</span>
<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>front-ptr '<span style="color: #859900;">()</span><span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">(</span>rear-ptr '<span style="color: #859900;">()</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">set-fptr!</span> item<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">set!</span> front-ptr item<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">set-rptr!</span> item<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">set!</span> rear-ptr item<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">empty-curryq?</span><span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">(</span>null? front-ptr<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">front-curryq</span><span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>empty-curryq?<span style="color: #859900;">)</span>
<span style="color: #859900;">(</span>error <span style="color: #2aa198;">"FRONT on empty queue"</span><span style="color: #859900;">)</span>
<span style="color: #859900;">(</span>car front-ptr<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">insert-curryq!</span> item<span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>new-pair <span style="color: #268bd2;">(</span>cons item '<span style="color: #6c71c4;">()</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
<span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #b58900;">[</span><span style="color: #268bd2;">(</span>empty-curryq?<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span>set-fptr! item<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span>set-rptr! item<span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span>
<span style="color: #b58900;">[</span><span style="color: #859900; font-weight: bold;">else</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">set!</span> rear-ptr new-pair<span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span>set-rptr! new-pair<span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">print-queue</span><span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">(</span>format #t <span style="color: #2aa198;">"~a~%"</span> front-ptr<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">dispatch</span> m<span style="color: #6c71c4;">)</span>
<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #859900;">[</span><span style="color: #b58900;">(</span>eq? m 'front-ptr<span style="color: #b58900;">)</span> front-ptr<span style="color: #859900;">]</span>
<span style="color: #859900;">[</span><span style="color: #b58900;">(</span>eq? m 'rear-ptr<span style="color: #b58900;">)</span> rear-ptr<span style="color: #859900;">]</span>
<span style="color: #859900;">[</span><span style="color: #b58900;">(</span>eq? m 'insert-queue!<span style="color: #b58900;">)</span> insert-curryq!<span style="color: #859900;">]</span>
<span style="color: #859900;">[</span><span style="color: #b58900;">(</span>eq? m 'print-queue<span style="color: #b58900;">)</span> print-queue<span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
dispatch<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6a5abc4" class="outline-3">
<h3 id="org6a5abc4">Exercise 3.23</h3>
<div class="outline-text-3" id="text-org6a5abc4">
<blockquote>
<p>
A deque (“double-ended queue”) is a sequence in which items can be inserted and
deleted at either the front or the rear. Operations on deques are the
constructor make-deque, the predicate empty-deque?, selectors front-deque and
rear-deque, and mutators front-insert-deque!, rear-insert-deque!,
front-delete-deque!, rear-delete-deque!. Show how to represent deques using
pairs, and give implementations of the operations. All operations should be
accomplished in Θ(1) steps.
</p>
</blockquote>
</div>

<div id="outline-container-org53a736f" class="outline-4">
<h4 id="org53a736f">Answer</h4>
<div class="outline-text-4" id="text-org53a736f">
<p>
#+begin<sub>src</sub> scheme
</p>
</div>
</div>
</div>
<div id="outline-container-orged00d54" class="outline-3">
<h3 id="orged00d54">Structure:</h3>
<div class="outline-text-3" id="text-orged00d54">
<p>
#+begin<sub>quote</sub>
This is the structure I've decided to use for the deque. There may be other
neat ways to encode a deque with cons-cells. I'd love to hear if anyone has
a better structure:
</p>

<p>
F: Front Ptr
B: Back Ptr
X: Value
/: Null or End
</p>

<p>
<del>---</del>&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">F</td>
<td class="org-left">B</td>
<td class="org-left">------------&#x2013;&#x2014;+</td>
</tr>
</tbody>
</table>
<p>
<del>-|-</del>&#x2014;+                 |
V                       V
<del>-</del>-<del>---</del>   <del>---</del>&#x2014;+   <del>-</del>-<del>---</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">*</td>
<td class="org-left">&#x2013;&gt;</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
<td class="org-left">&#x2013;&gt;</td>
<td class="org-left">*</td>
<td class="org-left">/</td>
</tr>
</tbody>
</table>
<p>
<del>-|-</del>&#x2014;+   <del>-|-</del>&#x2014;+   <del>-|-</del>&#x2014;+
V   ^&#x2014;+   V   ^&#x2014;+   V
<del>-</del>-<del>---</del> | <del>---</del>&#x2014;+ | <del>---</del>&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">X</td>
<td class="org-left">/</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">*</td>
</tr>
</tbody>
</table>
<p>
<del>---</del>&#x2014;+ | <del>---</del>-<del>-</del> | <del>---</del>-<del>-</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>   <del>-------</del>
</p>

<p>
(define (make-deque) '(() . ()))
(define (empty-deque? dq) (null? (front-deque dq)))
(define (front-deque dq) (car dq))
(define (rear-deque dq) (cdr dq))
(define (next-deque lst) (if (null? lst) '() (cdr lst)))
(define (prev-deque lst) (if (null? lst) '() (cdar lst)))
</p>

<p>
(define (front-insert-deque! dq value)
(let ([new-elt (cons (cons value '()) '())])
(cond
((empty-deque? dq)
(set-car! dq new-elt) (set-cdr! dq new-elt)
dq)
(else
;; link our next element to the current front
(set-cdr! new-elt (front-deque dq))
;; find the next element to make a backwards link
(set-cdr! (car (front-deque dq)) new-elt)
(set-car! dq new-elt)
dq))))
</p>

<p>
(define (rear-insert-deque! dq value)
(let ([new-elt (cons (cons value '()) '())])
(cond
((empty-deque? dq)
(set-car! dq new-elt) (set-cdr! dq new-elt)
dq)
(else
;; Link our backwards element
(set-cdr! (car new-elt) (rear-deque dq))
(set-cdr! (rear-deque dq) new-elt)
(set-cdr! dq new-elt)
dq))))
</p>

<p>
(define (front-delete-deque! dq)
(let ([next (next-deque (front-deque dq))]
[front (front-deque dq)])
(cond
((null? next) (set-car! dq '()) (set-cdr! dq '()))
(else
(set-car! dq next)
(set-cdr! (car (front-deque dq)) '())))
front))
</p>

<p>
(define (rear-delete-deque! dq)
(let ([rear (rear-deque dq)]
[prev (prev-deque (rear-deque dq))])
(cond
((null? rear) (set-car! dq '()) (set-cdr! dq '()))
(else
(set-cdr! dq prev)
(set-cdr! (rear-deque dq) '())))
rear))
#+end<sub>src</sub>
</p>
</div>
</div>
