org/_posts/2019-06-23-sicp-chapter-3.org
** Exercise 3.24:
   #+begin_quote
   In the table implementations above, the keys are tested for equality using
   `equal?' (called by `assoc'). This is not always the appropriate test. For
   instance, we might have a table with numeric keys in which we don't need an
   exact match to the number we're looking up, but only a number within some
   tolerance of it. Design a table constructor `make-table' that takes as an
   argument a `same-key?' procedure that will be used to test "equality" of
   keys. `Make-table' should return a `dispatch' procedure that can be used to
   access appropriate `lookup' and `insert!' procedures for a local table.

   #+end_quote
*** Answer
    #+begin_src scheme

      (define (make-table-with-key same-key?)
        (let ((local-table (list '*table*)))
          ;; just redefine `assoc' with `same-key?'
          (define (assoc key records)
            (cond ((null? records) #f)
                  ((same-key? key (caar records)) (car records))
                  (else (assoc key (cdr records)))))
          (define (lookup key-1 key-2)
            (let ((subtable (assoc key-1 (cdr local-table))))
              (if subtable
                  (let ((record (assoc key-2 (cdr subtable))))
                    (if record
                        (cdr record)
                        #f))
                  #f)))
          (define (insert! key-1 key-2 value)
            (let ((subtable (assoc key-1 (cdr local-table))))
              (if subtable
                  (let ((record (assoc key-2 (cdr subtable))))
                    (if record
                        (set-cdr! record value)
                        (set-cdr! subtable
                                  (cons (cons key-2 value)
                                        (cdr subtable)))))
                  (set-cdr! local-table
                            (cons (list key-1
                                        (cons key-2 value))
                                  (cdr local-table))))))
          (define (dispatch m)
            (cond ((eq? m 'lookup-proc) lookup)
                  ((eq? m 'insert-proc!) insert!)))
          dispatch))
    #+end_src

** Exercise 3.25
   #+begin_quote
   Generalizing one and two-dimensional tables, show how to implement a table
   in which values are stored under an arbitrary number of keys and different
   values may be stored under different numbers of keys. The `lookup' and
   `insert!' procedures should take as input a list of keys used to access the
   table.

   #+end_quote
*** Answer
    #+begin_src scheme

** Answer:
   #+begin_quote
   The easiest way to accomplish this is to accept variadic arguments to
   `insert' and `lookup', folding them into a string or using the list
   directly (which `equal?' can compare)

   #+end_quote
*** Answer
    #+begin_src scheme
    #+end_src#+end_src

** Exercise 3.26
   #+begin_quote
   To search a table as implemented above, one needs to scan through the list
   of records. This is basically the unordered list representation of section
   *Note 2-3-3. For large tables, it may be more efficient to structure the
   table in a different manner. Describe a table implementation where the
   (key, value) records are organized using a binary tree, assuming that keys
   can be ordered in some way (e.g., numerically or alphabetically). (Compare
   Exercise 2-66 of Chapter 2)
   #+end_quote

*** Answer:
    #+begin_src scheme
   ;; The value that is to be inserted is converted into it's numeric form. Insert
   ;; & Lookup function as you would expect
    #+end_src
   
