_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-orgc1bc340" class="outline-3">
<h3 id="orgc1bc340">Exercise 3.24:</h3>
<div class="outline-text-3" id="text-orgc1bc340">
<blockquote>
<p>
In the table implementations above, the keys are tested for equality using
`equal?' (called by `assoc'). This is not always the appropriate test. For
instance, we might have a table with numeric keys in which we don't need an
exact match to the number we're looking up, but only a number within some
tolerance of it. Design a table constructor `make-table' that takes as an
argument a `same-key?' procedure that will be used to test "equality" of
keys. `Make-table' should return a `dispatch' procedure that can be used to
access appropriate `lookup' and `insert!' procedures for a local table.
</p>
</blockquote>
</div>
<div id="outline-container-orgab90fb5" class="outline-4">
<h4 id="orgab90fb5">Answer</h4>
<div class="outline-text-4" id="text-orgab90fb5">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-table-with-key</span> same-key?<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>local-table <span style="color: #859900;">(</span>list '*table*<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">just redefine `assoc' with `same-key?'</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">assoc</span> key records<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>null? records<span style="color: #b58900;">)</span> #f<span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>same-key? key <span style="color: #268bd2;">(</span>caar records<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>car records<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #b58900;">(</span>assoc key <span style="color: #268bd2;">(</span>cdr records<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">lookup</span> key-1 key-2<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>subtable <span style="color: #268bd2;">(</span>assoc key-1 <span style="color: #6c71c4;">(</span>cdr local-table<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">if</span> subtable
            <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>record <span style="color: #859900;">(</span>assoc key-2 <span style="color: #2aa198;">(</span>cdr subtable<span style="color: #2aa198;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
              <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> record
                  <span style="color: #6c71c4;">(</span>cdr record<span style="color: #6c71c4;">)</span>
                  #f<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
            #f<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">insert!</span> key-1 key-2 value<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>subtable <span style="color: #268bd2;">(</span>assoc key-1 <span style="color: #6c71c4;">(</span>cdr local-table<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">if</span> subtable
            <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>record <span style="color: #859900;">(</span>assoc key-2 <span style="color: #2aa198;">(</span>cdr subtable<span style="color: #2aa198;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
              <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> record
                  <span style="color: #6c71c4;">(</span>set-cdr! record value<span style="color: #6c71c4;">)</span>
                  <span style="color: #6c71c4;">(</span>set-cdr! subtable
                            <span style="color: #859900;">(</span>cons <span style="color: #2aa198;">(</span>cons key-2 value<span style="color: #2aa198;">)</span>
                                  <span style="color: #2aa198;">(</span>cdr subtable<span style="color: #2aa198;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>set-cdr! local-table
                      <span style="color: #268bd2;">(</span>cons <span style="color: #6c71c4;">(</span>list key-1
                                  <span style="color: #859900;">(</span>cons key-2 value<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
                            <span style="color: #6c71c4;">(</span>cdr local-table<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">dispatch</span> m<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>eq? m 'lookup-proc<span style="color: #b58900;">)</span> lookup<span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>eq? m 'insert-proc!<span style="color: #b58900;">)</span> insert!<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    dispatch<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga38d5d2" class="outline-3">
<h3 id="orga38d5d2">Exercise 3.25</h3>
<div class="outline-text-3" id="text-orga38d5d2">
<blockquote>
<p>
Generalizing one and two-dimensional tables, show how to implement a table
in which values are stored under an arbitrary number of keys and different
values may be stored under different numbers of keys. The `lookup' and
`insert!' procedures should take as input a list of keys used to access the
table.
</p>
</blockquote>
</div>
<div id="outline-container-orgcbccbff" class="outline-4">
<h4 id="orgcbccbff">Answer</h4>
<div class="outline-text-4" id="text-orgcbccbff">
<p>
#+begin<sub>src</sub> scheme
</p>
</div>
</div>
</div>

<div id="outline-container-orgd1f2f3a" class="outline-3">
<h3 id="orgd1f2f3a">Answer:</h3>
<div class="outline-text-3" id="text-orgd1f2f3a">
<blockquote>
<p>
The easiest way to accomplish this is to accept variadic arguments to
`insert' and `lookup', folding them into a string or using the list
directly (which `equal?' can compare)
</p>
</blockquote>
</div>
<div id="outline-container-org05808b2" class="outline-4">
<h4 id="org05808b2">Answer</h4>
<div class="outline-text-4" id="text-org05808b2">
<p>
#+begin<sub>src</sub> scheme
#+end<sub>src</sub>#+end<sub>src</sub>
</p>
</div>
</div>
</div>

<div id="outline-container-org1d4cc88" class="outline-3">
<h3 id="org1d4cc88">Exercise 3.26</h3>
<div class="outline-text-3" id="text-org1d4cc88">
<blockquote>
<p>
To search a table as implemented above, one needs to scan through the list
of records. This is basically the unordered list representation of section
*Note 2-3-3. For large tables, it may be more efficient to structure the
table in a different manner. Describe a table implementation where the
(key, value) records are organized using a binary tree, assuming that keys
can be ordered in some way (e.g., numerically or alphabetically). (Compare
Exercise 2-66 of Chapter 2)
</p>
</blockquote>
</div>

<div id="outline-container-org232b8a7" class="outline-4">
<h4 id="org232b8a7">Answer:</h4>
<div class="outline-text-4" id="text-org232b8a7">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">The value that is to be inserted is converted into it's numeric form. Insert</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">&amp; Lookup function as you would expect</span>
</pre>
</div>
</div>
</div>
</div>
