org/_posts/2019-06-23-sicp-chapter-3.org
** Exercise 3.27
   #+begin_quote
    "Memoization" (also called "tabulation") is a technique that enables a
    procedure to record, in a local table, values that have previously been
    computed. This technique can make a vast difference in the performance of a
    program. A memoized procedure maintains a table in which values of previous
    calls are stored using as keys the arguments that produced the values. When
    the memoized procedure is asked to compute a value, it first checks the
    table to see if the value is already there and, if so, just returns that
    value. Otherwise, it computes the new value in the ordinary way and stores
    this in the table. As an example of memoization, recall from section
    1-2-2 the exponential process for computing Fibonacci numbers:

    (define (fib n)
    (cond ((= n 0) 0)
    ((= n 1) 1)
    (else (+ (fib (- n 1))
    (fib (- n 2))))))

    The memoized version of the same procedure is

    (define memo-fib
    (memoize (lambda (n)
    (cond ((= n 0) 0)
    ((= n 1) 1)
    (else (+ (memo-fib (- n 1))
    (memo-fib (- n 2))))))))

    where the memoizer is defined as

    (define (memoize f)
    (let ((table (make-table)))
    (lambda (x)
    (let ((previously-computed-result (lookup x table)))
    (or previously-computed-result
    (let ((result (f x)))
    (insert! x result table)
    result))))))

    Draw an environment diagram to analyze the computation of `(memo-fib
    3)'. Explain why `memo-fib' computes the nth Fibonacci number in a number
    of steps proportional to n. Would the scheme still work if we had simply
    defined `memo-fib' to be `(memoize fib)'?
    #+end_quote

*** Answer:
    #+begin_src scheme
   ;; memo-fib is O(N) because the fibonacci sequence can simply be computed in
   ;; 2*(Σ(N)) steps (half of which are 'precomputed')
   ;; The scheme would not work if each function were freshly memoized because
   ;; the `table' would not be shared between the various applications of
   ;; `memo-fib'. 
    #+end_src


** Exercise 3.28
   #+begin_quote
   Define an or-gate as a primitive function box. Your or-gate constructor should
   be similar to and-gate.

   #+end_quote
*** Answer
    #+begin_src scheme
      (define or-gate-delay 5)
      (define (or-gate a1 a2 output)
        (define (or-action-procedure)
          (let ((new-value
                 (logior (signal-value a1)
                         (signal-value a2))))
            (after-delay
             or-gate-delay
             (λ ()
               (set-signal! output new-value)))))
        (add-action! a1 or-action-procedure)
        (add-action! a2 or-action-procedure)
        'ok)
    #+end_src

** Exercise 3.29
   #+begin_quote
   Another way to construct an or-gate is as a compound digital logic device, built
   from and-gates and inverters. Define a procedure or-gate that accomplishes this.
   What is the delay time of the or-gate in terms of and-gate-delay and
   inverter-delay? 
   #+end_quote
   
*** Answer
    #+begin_src scheme
   (!a1) && a2 is congruent to a1 || a2, it is as fast as (AND-DELAY + INVERTER_DELAY)
    #+end_src


** TODO Exercise 3.30
   #+begin_quote
   Figure 3.27 shows a ripple-carry adder formed by stringing together n
   full-adders. This is the simplest form of parallel adder for adding two n -bit
   binary numbers. The inputs A 1 , A 2 , A 3 , …, A n and B 1 , B 2 , B 3 , …, B n
   are the two binary numbers to be added (each A k and B k is a 0 or a 1). The
   circuit generates S 1 , S 2 , S 3 , …, S n , the n bits of the sum, and C , the
   carry from the addition. Write a procedure ripple-carry-adder that generates
   this circuit. The procedure should take as arguments three lists of n wires
   each—the A k , the B k , and the S k —and also another wire C . The major
   drawback of the ripple-carry adder is the need to wait for the carry signals to
   propagate. What is the delay needed to obtain the complete output from an n -bit
   ripple-carry adder, expressed in terms of the delays for and-gates, or-gates,
   and inverters?

   #+end_quote
*** Answer
    #+begin_src scheme
    #+end_src

** Exercise 3.31
   #+begin_quote
   The internal procedure `accept-action-procedure!' defined in make-wire specifies
   that when a new action procedure is added to a wire, the procedure is
   immediately run. Explain why this initialization is necessary. In particular,
   trace through the half-adder example in the paragraphs above and say how the
   system’s response would differ if we had defined accept-action-procedure! as

   (define (accept-action-procedure! proc)
   (set! action-procedures
   (cons proc action-procedures)))

   #+end_quote

*** Answer:
   #+begin_src scheme
   ;; the signal value must be initialized or the entire system will run the action
   ;; procedures (no matter what has changed)
   #+end_src

** TODO Exercise 3.32
   #+begin_quote
   The procedures to be run during each time segment of the agenda are kept in a
   queue. Thus, the procedures for each segment are called in the order in which
   they were added to the agenda (first in, first out). Explain why this order must
   be used. In particular, trace the behavior of an and-gate whose inputs change
   from 0, 1 to 1, 0 in the same segment and say how the behavior would differ if
   we stored a segment’s procedures in an ordinary list, adding and removing
   procedures only at the front (last in, first out).
   #+end_quote

** Exercise 3.33
   #+begin_quote
   Using primitive multiplier, adder, and constant constraints, define a procedure
   averager that takes three connectors a, b, and c as inputs and establishes the
   constraint that the value of c is the average of the values of a and b. 
   #+end_quote
