_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-orga1981c4" class="outline-3">
<h3 id="orga1981c4">Exercise 3.27</h3>
<div class="outline-text-3" id="text-orga1981c4">
<blockquote>
<p>
"Memoization" (also called "tabulation") is a technique that enables a
procedure to record, in a local table, values that have previously been
computed. This technique can make a vast difference in the performance of a
program. A memoized procedure maintains a table in which values of previous
calls are stored using as keys the arguments that produced the values. When
the memoized procedure is asked to compute a value, it first checks the
table to see if the value is already there and, if so, just returns that
value. Otherwise, it computes the new value in the ordinary way and stores
this in the table. As an example of memoization, recall from section
1-2-2 the exponential process for computing Fibonacci numbers:
</p>

<p>
(define (fib n)
(cond ((= n 0) 0)
((= n 1) 1)
(else (+ (fib (- n 1))
(fib (- n 2))))))
</p>

<p>
The memoized version of the same procedure is
</p>

<p>
(define memo-fib
(memoize (lambda (n)
(cond ((= n 0) 0)
((= n 1) 1)
(else (+ (memo-fib (- n 1))
(memo-fib (- n 2))))))))
</p>

<p>
where the memoizer is defined as
</p>

<p>
(define (memoize f)
(let ((table (make-table)))
(lambda (x)
(let ((previously-computed-result (lookup x table)))
(or previously-computed-result
(let ((result (f x)))
(insert! x result table)
result))))))
</p>

<p>
Draw an environment diagram to analyze the computation of `(memo-fib
3)'. Explain why `memo-fib' computes the nth Fibonacci number in a number
of steps proportional to n. Would the scheme still work if we had simply
defined `memo-fib' to be `(memoize fib)'?
</p>
</blockquote>
</div>

<div id="outline-container-org8748d05" class="outline-4">
<h4 id="org8748d05">Answer:</h4>
<div class="outline-text-4" id="text-org8748d05">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">memo-fib is O(N) because the fibonacci sequence can simply be computed in</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">2*(&#931;(N)) steps (half of which are 'precomputed')</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">The scheme would not work if each function were freshly memoized because</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">the `table' would not be shared between the various applications of</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">`memo-fib'. </span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org175ac51" class="outline-3">
<h3 id="org175ac51">Exercise 3.28</h3>
<div class="outline-text-3" id="text-org175ac51">
<blockquote>
<p>
Define an or-gate as a primitive function box. Your or-gate constructor should
be similar to and-gate.
</p>
</blockquote>
</div>
<div id="outline-container-orgad31936" class="outline-4">
<h4 id="orgad31936">Answer</h4>
<div class="outline-text-4" id="text-orgad31936">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">or-gate-delay</span> <span style="color: #6c71c4;">5</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">or-gate</span> a1 a2 output<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">or-action-procedure</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>new-value
           <span style="color: #b58900;">(</span>logior <span style="color: #268bd2;">(</span>signal-value a1<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>signal-value a2<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>after-delay
       or-gate-delay
       <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">()</span>
         <span style="color: #b58900;">(</span>set-signal! output new-value<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>add-action! a1 or-action-procedure<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>add-action! a2 or-action-procedure<span style="color: #b58900;">)</span>
  'ok<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3ce181f" class="outline-3">
<h3 id="org3ce181f">Exercise 3.29</h3>
<div class="outline-text-3" id="text-org3ce181f">
<blockquote>
<p>
Another way to construct an or-gate is as a compound digital logic device, built
from and-gates and inverters. Define a procedure or-gate that accomplishes this.
What is the delay time of the or-gate in terms of and-gate-delay and
inverter-delay? 
</p>
</blockquote>
</div>

<div id="outline-container-org2180445" class="outline-4">
<h4 id="org2180445">Answer</h4>
<div class="outline-text-4" id="text-org2180445">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>!a1<span style="color: #2aa198;">)</span> &amp;&amp; a2 is congruent to a1 <span style="color: #2aa198;">||</span> a2, it is as fast as <span style="color: #2aa198;">(</span>AND-DELAY + INVERTER_DELAY<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orge10d07f" class="outline-3">
<h3 id="orge10d07f"><span class="todo TODO">TODO</span> Exercise 3.30</h3>
<div class="outline-text-3" id="text-orge10d07f">
<blockquote>
<p>
Figure 3.27 shows a ripple-carry adder formed by stringing together n
full-adders. This is the simplest form of parallel adder for adding two n -bit
binary numbers. The inputs A 1 , A 2 , A 3 , …, A n and B 1 , B 2 , B 3 , …, B n
are the two binary numbers to be added (each A k and B k is a 0 or a 1). The
circuit generates S 1 , S 2 , S 3 , …, S n , the n bits of the sum, and C , the
carry from the addition. Write a procedure ripple-carry-adder that generates
this circuit. The procedure should take as arguments three lists of n wires
each—the A k , the B k , and the S k —and also another wire C . The major
drawback of the ripple-carry adder is the need to wait for the carry signals to
propagate. What is the delay needed to obtain the complete output from an n -bit
ripple-carry adder, expressed in terms of the delays for and-gates, or-gates,
and inverters?
</p>
</blockquote>
</div>
<div id="outline-container-org38ef913" class="outline-4">
<h4 id="org38ef913">Answer</h4>
<div class="outline-text-4" id="text-org38ef913">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga4d9e75" class="outline-3">
<h3 id="orga4d9e75">Exercise 3.31</h3>
<div class="outline-text-3" id="text-orga4d9e75">
<blockquote>
<p>
The internal procedure `accept-action-procedure!' defined in make-wire specifies
that when a new action procedure is added to a wire, the procedure is
immediately run. Explain why this initialization is necessary. In particular,
trace through the half-adder example in the paragraphs above and say how the
system’s response would differ if we had defined accept-action-procedure! as
</p>

<p>
(define (accept-action-procedure! proc)
(set! action-procedures
(cons proc action-procedures)))
</p>
</blockquote>
</div>

<div id="outline-container-orgfa915e9" class="outline-4">
<h4 id="orgfa915e9">Answer:</h4>
<div class="outline-text-4" id="text-orgfa915e9">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">the signal value must be initialized or the entire system will run the action</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">procedures (no matter what has changed)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org56e9bb8" class="outline-3">
<h3 id="org56e9bb8"><span class="todo TODO">TODO</span> Exercise 3.32</h3>
<div class="outline-text-3" id="text-org56e9bb8">
<blockquote>
<p>
The procedures to be run during each time segment of the agenda are kept in a
queue. Thus, the procedures for each segment are called in the order in which
they were added to the agenda (first in, first out). Explain why this order must
be used. In particular, trace the behavior of an and-gate whose inputs change
from 0, 1 to 1, 0 in the same segment and say how the behavior would differ if
we stored a segment’s procedures in an ordinary list, adding and removing
procedures only at the front (last in, first out).
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orgc9994c4" class="outline-3">
<h3 id="orgc9994c4">Exercise 3.33</h3>
<div class="outline-text-3" id="text-orgc9994c4">
<blockquote>
<p>
Using primitive multiplier, adder, and constant constraints, define a procedure
averager that takes three connectors a, b, and c as inputs and establishes the
constraint that the value of c is the average of the values of a and b. 
</p>
</blockquote>
</div>
