org/_posts/2019-06-23-sicp-chapter-3.org
*** Answer
    #+begin_src scheme
      (define (averager a b c)
        (with-connectors (half sum)
                         (constant 0.5 half)
                         (adder a b sum)
                         (multiplier half sum c)
                         'ok))
    #+end_src

** Exercise 3.34
   #+begin_quote
   Louis Reasoner wants to build a squarer, a constraint device with two terminals
   such that the value of connector b on the second terminal will always be the
   square of the value a on the first terminal. He proposes the following simple
   device made from a multiplier:

   (define (squarer a b) (multiplier a a b))

   There is a serious flaw in this idea. Explain.

   #+end_quote
*** Answer
    #+begin_src scheme
      ;; Answer: The value of `a' is not "duplicated" across -- so `process-new-value' only
      ;; reads either `rhs' or `lhs''s value
    #+end_src

** Exercise 3.35
   #+begin_quote
   Ben Bitdiddle tells Louis that one way to avoid the trouble in
   Exercise 3.34 is to define a squarer as a new primitive constraint. Fill in the
   missing portions in Ben’s outline for a procedure to implement such a
   constraint:

   (define (squarer a b)
   (define (process-new-value)
   (if (has-value? b)
   (if (< (get-value b) 0)
   (error "square less than 0:
   SQUARER"
   (get-value b))
   ⟨alternative1⟩)
   ⟨alternative2⟩))
   (define (process-forget-value) ⟨body1⟩)
   (define (me request) ⟨body2⟩)
   ⟨rest of definition⟩
   me)

   #+end_quote
*** Answer
    #+begin_src scheme

      (define-class <squarer> (<constraint>)
        ;; in squarer, there is essentially only one value
        (rhs #:allocation #:virtual
             #:slot-ref (lambda (o) (slot-ref o 'lhs))
             #:slot-set! (lambda (o s) (slot-set! o 'lhs s)))
        ;; strictly speaking these are not nessasary, as they are defined directly in
        ;; `process-new-value', they are kept for posteriety.
        (operator #:init-value square)
        (inverse-operator #:init-value sqrt))

      (define-method (process-new-value (c <squarer>))
        (let* ([lhs-conn (lhs c)]
               [total-conn (total c)]
               [has-total? (has-value? total-conn)]
               [has-lhs? (has-value? lhs-conn)])
          ;; Determine what values *are* known and set the appropriate connector.
          (cond
           ;; (lhs < 0) => error
           [(and (has-lhs?
                  (< (connector-value lhs-conn) 0)))
            (error "square less than 0: SQUARER" (connector-value lhs-conn))]

           ;; lhs = √total
           [has-total?
            (set-value! lhs-conn (sqrt (connector-value total-conn)) c)]

           ;; total = lh²
           [has-lhs?
            (set-value! total-conn (square (connector-value lhs-conn)) c)])))

      (define-method (process-forget-value (c <squarer>))
        (forget-value! (lhs c) c)
        (forget-value! (total c) c)
        (process-new-value c))
    #+end_src

** TODO Exercise 3.36 
   #+begin_quote
   Suppose we evaluate the following sequence of expressions in the global
   environment:

   (define a (make-connector)) (define b (make-connector)) (set-value! a 10 'user)

   At some time during evaluation of the set-value!, the following expression from
   the connector’s local procedure is evaluated:

   (for-each-except setter inform-about-value constraints)

   Draw an environment diagram showing the environment in which the above
   expression is evaluated. 
   #+end_quote
*** Answer
    #+begin_src scheme

    #+end_src

** Exercise 3.37
   #+begin_quote
   The celsius-fahrenheit-converter procedure is cumbersome when compared with a
   more expression-oriented style of definition, such as

   (define (celsius-fahrenheit-converter x)
   (c+ (c* (c/ (cv 9) (cv 5))
   x)
   (cv 32)))

   (define C (make-connector))
   (define F (celsius-fahrenheit-converter C))

   Here c+, c*, etc. are the “constraint” versions of the arithmetic operations.
   For example, c+ takes two connectors as arguments and returns a connector that
   is related to these by an adder constraint:

   (define (c+ x y)
   (let ((z (make-connector)))
   (adder x y z)
   z))

   Define analogous procedures c-, c*, c/, and cv (constant value) that enable us
   to define compound constraints as in the converter example above.

   #+end_quote
