_posts/2019-06-23-sicp-chapter-3.html
<div id="outline-container-org61d9506" class="outline-4">
<h4 id="org61d9506">Answer</h4>
<div class="outline-text-4" id="text-org61d9506">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">averager</span> a b c<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>with-connectors <span style="color: #268bd2;">(</span>half sum<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>constant <span style="color: #6c71c4;">0.5</span> half<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>adder a b sum<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>multiplier half sum c<span style="color: #268bd2;">)</span>
                   'ok<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgac4761b" class="outline-3">
<h3 id="orgac4761b">Exercise 3.34</h3>
<div class="outline-text-3" id="text-orgac4761b">
<blockquote>
<p>
Louis Reasoner wants to build a squarer, a constraint device with two terminals
such that the value of connector b on the second terminal will always be the
square of the value a on the first terminal. He proposes the following simple
device made from a multiplier:
</p>

<p>
(define (squarer a b) (multiplier a a b))
</p>

<p>
There is a serious flaw in this idea. Explain.
</p>
</blockquote>
</div>
<div id="outline-container-orgf76f72d" class="outline-4">
<h4 id="orgf76f72d">Answer</h4>
<div class="outline-text-4" id="text-orgf76f72d">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Answer: The value of `a' is not "duplicated" across -- so `process-new-value' only</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">reads either `rhs' or `lhs''s value</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga5c2550" class="outline-3">
<h3 id="orga5c2550">Exercise 3.35</h3>
<div class="outline-text-3" id="text-orga5c2550">
<blockquote>
<p>
Ben Bitdiddle tells Louis that one way to avoid the trouble in
Exercise 3.34 is to define a squarer as a new primitive constraint. Fill in the
missing portions in Ben’s outline for a procedure to implement such a
constraint:
</p>

<p>
(define (squarer a b)
(define (process-new-value)
(if (has-value? b)
(if (&lt; (get-value b) 0)
(error "square less than 0:
SQUARER"
(get-value b))
⟨alternative1⟩)
⟨alternative2⟩))
(define (process-forget-value) ⟨body1⟩)
(define (me request) ⟨body2⟩)
⟨rest of definition⟩
me)
</p>
</blockquote>
</div>
<div id="outline-container-org60f04d3" class="outline-4">
<h4 id="org60f04d3">Answer</h4>
<div class="outline-text-4" id="text-org60f04d3">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define-class</span> <span style="color: #b58900;">&lt;squarer&gt;</span> <span style="color: #b58900;">(</span><span style="color: #b58900;">&lt;constraint&gt;</span><span style="color: #b58900;">)</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">in squarer, there is essentially only one value</span>
  <span style="color: #b58900;">(</span>rhs <span style="color: #657b83; font-weight: bold;">#:allocation</span> <span style="color: #657b83; font-weight: bold;">#:virtual</span>
       <span style="color: #657b83; font-weight: bold;">#:slot-ref</span> <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #6c71c4;">(</span>o<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>slot-ref o 'lhs<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #657b83; font-weight: bold;">#:slot-set!</span> <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #6c71c4;">(</span>o s<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>slot-set! o 'lhs s<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">strictly speaking these are not nessasary, as they are defined directly in</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">`process-new-value', they are kept for posteriety.</span>
  <span style="color: #b58900;">(</span>operator <span style="color: #657b83; font-weight: bold;">#:init-value</span> square<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>inverse-operator <span style="color: #657b83; font-weight: bold;">#:init-value</span> sqrt<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define-method</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">process-new-value</span> <span style="color: #268bd2;">(</span>c <span style="color: #b58900;">&lt;squarer&gt;</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>lhs-conn <span style="color: #859900;">(</span>lhs c<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>total-conn <span style="color: #859900;">(</span>total c<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>has-total? <span style="color: #859900;">(</span>has-value? total-conn<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>has-lhs? <span style="color: #859900;">(</span>has-value? lhs-conn<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Determine what values *are* known and set the appropriate connector.</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
     <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(lhs &lt; 0) =&gt; error</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #b58900;">(</span>has-lhs?
            <span style="color: #268bd2;">(</span>&lt; <span style="color: #6c71c4;">(</span>connector-value lhs-conn<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span>error <span style="color: #2aa198;">"square less than 0: SQUARER"</span> <span style="color: #b58900;">(</span>connector-value lhs-conn<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>

     <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">lhs = &#8730;total</span>
     <span style="color: #6c71c4;">[</span>has-total?
      <span style="color: #859900;">(</span>set-value! lhs-conn <span style="color: #b58900;">(</span>sqrt <span style="color: #268bd2;">(</span>connector-value total-conn<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> c<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>

     <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">total = lh&#178;</span>
     <span style="color: #6c71c4;">[</span>has-lhs?
      <span style="color: #859900;">(</span>set-value! total-conn <span style="color: #b58900;">(</span>square <span style="color: #268bd2;">(</span>connector-value lhs-conn<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> c<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define-method</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">process-forget-value</span> <span style="color: #268bd2;">(</span>c <span style="color: #b58900;">&lt;squarer&gt;</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>forget-value! <span style="color: #268bd2;">(</span>lhs c<span style="color: #268bd2;">)</span> c<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>forget-value! <span style="color: #268bd2;">(</span>total c<span style="color: #268bd2;">)</span> c<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>process-new-value c<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcab7e34" class="outline-3">
<h3 id="orgcab7e34"><span class="todo TODO">TODO</span> Exercise 3.36</h3>
<div class="outline-text-3" id="text-orgcab7e34">
<blockquote>
<p>
Suppose we evaluate the following sequence of expressions in the global
environment:
</p>

<p>
(define a (make-connector)) (define b (make-connector)) (set-value! a 10 'user)
</p>

<p>
At some time during evaluation of the set-value!, the following expression from
the connector’s local procedure is evaluated:
</p>

<p>
(for-each-except setter inform-about-value constraints)
</p>

<p>
Draw an environment diagram showing the environment in which the above
expression is evaluated. 
</p>
</blockquote>
</div>
<div id="outline-container-org62bcdde" class="outline-4">
<h4 id="org62bcdde">Answer</h4>
<div class="outline-text-4" id="text-org62bcdde">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf945032" class="outline-3">
<h3 id="orgf945032">Exercise 3.37</h3>
<div class="outline-text-3" id="text-orgf945032">
<blockquote>
<p>
The celsius-fahrenheit-converter procedure is cumbersome when compared with a
more expression-oriented style of definition, such as
</p>

<p>
(define (celsius-fahrenheit-converter x)
(c+ (c* (c/ (cv 9) (cv 5))
x)
(cv 32)))
</p>

<p>
(define C (make-connector))
(define F (celsius-fahrenheit-converter C))
</p>

<p>
Here c+, c*, etc. are the “constraint” versions of the arithmetic operations.
For example, c+ takes two connectors as arguments and returns a connector that
is related to these by an adder constraint:
</p>

<p>
(define (c+ x y)
(let ((z (make-connector)))
(adder x y z)
z))
</p>

<p>
Define analogous procedures c-, c*, c/, and cv (constant value) that enable us
to define compound constraints as in the converter example above.
</p>
</blockquote>
</div>
