org/_posts/2019-06-23-sicp-chapter-3.org
*** Answer
    #+begin_src scheme
      (define (c+ augend addend)
        (with-connectors (sum)
                         (adder augend addend sum)
                         sum))

      (define (c- minuend subtrahend)
        (with-connectors (difference)
                         (adder difference subtrahend minuend)
                         difference))

      (define (c* multiplicand m2)
        (with-connectors (product)
                         (multiplier multiplicand  m2 product)
                         product))

      (define (c/ dividend divisor)
        (with-connectors (quotient)
                         (multiplier quotient divisor dividend)
                         quotient))
      (define (cv value)
        (with-connectors (result)
                         (constant value result)
                         result))
    #+end_src

** Exercise 3.38
   #+begin_quote
   Suppose that Peter, Paul, and Mary share a joint bank account that initially
   contains $100. Concurrently, Peter deposits $10, Paul withdraws $20, and Mary
   withdraws half the money in the account, by executing the following commands:

   Peter: (set! balance (+ balance 10))
   Paul:  (set! balance (- balance 20))
   Mary:  (set! balance (- balance (/ balance 2)))

   1.  List all the different possible values for balance after these three
      transactions have been completed, assuming that the banking system forces the
      three processes to run sequentially in some order.

   2.  What are some other values that could be produced if the system allows the
      processes to be interleaved? Draw timing diagrams like the one in Figure 3.29 to
      explain how these values can occur.

   #+end_quote
*** Answer
    #+begin_src scheme

      #| Answer (1):
      Peter->Paul->Mary: (calc-eval "((100+10)-20)/2")       => 45
      Peter->Mary->Paul: (calc-eval "((100+10)/2)-20")       => 35
      Mary->Paul->Peter: (calc-eval "((100 / 2) - 20) + 20") => 50
      Mary->Peter->Paul: (calc-eval "((100 / 2) + 10) - 20") => 40
      Paul->Peter->Mary: (calc-eval "((100 - 20) + 10) / 2") => 45
      Paul->Mary->Peter: (calc-eval "((100 - 20) / 2) + 10") => 50
      |#


    #+end_src

** Exercise 3.39
   #+begin_quote
    Which of the five possibilities in the parallel execution shown above remain if
    we instead serialize execution as follows:

    (define x 10)
    (define s (make-serializer))
    (parallel-execute
    (lambda ()
    (set! x ((s (lambda () (* x x))))))
    (s (lambda () (set! x (+ x 1)))))
   #+end_quote
*** Answer
    #+begin_src scheme
    ;; ANSWER: 101, 100, 121
    #+end_src


** Exercise 3.40
   #+begin_quote
   Give all possible values of x that can result from executing

   (define x 10)
   (parallel-execute
   (lambda () (set! x (* x x)))
   (lambda () (set! x (* x x x))))

   Which of these possibilities remain if we instead use serialized procedures:

   (define x 10)
   (define s (make-serializer))
   (parallel-execute
   (s (lambda () (set! x (* x x))))
   (s (lambda () (set! x (* x x x)))))

   #+end_quote
*** Answer
    #+begin_src scheme
      ;; Answer: x*6 (multiplication is commutative)
    #+end_src

** Exercise 3.41
   #+begin_quote
   Ben Bitdiddle worries that it would be better to implement the bank account as
   follows (where the commented line has been changed):

   (define (make-account balance)
   (define (withdraw amount)
   (if (>= balance amount)
   (begin
   (set! balance
   (- balance amount))
   balance)
   "Insufficient funds"))
   (define (deposit amount)
   (set! balance (+ balance amount))
   balance)
   (let ((protected (make-serializer)))
   (define (dispatch m)
   (cond ((eq? m 'withdraw)
   (protected withdraw))
   ((eq? m 'deposit)
   (protected deposit))
   ((eq? m 'balance)
   ((protected
   (lambda ()
   balance)))) ; serialized
   (else
   (error
   "Unknown request:
   MAKE-ACCOUNT"
   m))))
   dispatch))

   because allowing unserialized access to the bank balance can result in anomalous
   behavior. Do you agree? Is there any scenario that demonstrates Ben’s concern?

   #+end_quote
*** Answer
    #+begin_src scheme

      ;; First off, this question is phrased in a really shitty way. Second off, no
      ;; *BALANCE* is safe. the other functions are *UNSAFE*

    #+end_src

** Exercise 3.42
   #+begin_quote
    Ben Bitdiddle suggests that it’s a waste of time to create a new serialized
    procedure in response to every withdraw and deposit message. He says that
    make-account could be changed so that the calls to protected are done outside
    the dispatch procedure. That is, an account would return the same serialized
    procedure (which was created at the same time as the account) each time it is
    asked for a withdrawal procedure.

    (define (make-account balance)
    (define (withdraw amount)
    (if (>= balance amount)
    (begin (set! balance
    (- balance amount))
    balance)
    "Insufficient funds"))
    (define (deposit amount)
    (set! balance (+ balance amount))
    balance)
    (let ((protected (make-serializer)))
    (let ((protected-withdraw
    (protected withdraw))
    (protected-deposit
    (protected deposit)))
    (define (dispatch m)
    (cond ((eq? m 'withdraw)
    protected-withdraw)
    ((eq? m 'deposit)
    protected-deposit)
    ((eq? m 'balance)
    balance)
    (else
    (error "Unknown request:
    MAKE-ACCOUNT"
    m))))
    dispatch)))
   #+end_quote

*** Answer
    #+begin_src scheme
 ;; Answer: This is fine
    #+end_src

