_posts/2019-06-23-sicp-chapter-3.html
<div id="outline-container-orgce0eb5d" class="outline-4">
<h4 id="orgce0eb5d">Answer</h4>
<div class="outline-text-4" id="text-orgce0eb5d">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">c+</span> augend addend<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>with-connectors <span style="color: #268bd2;">(</span>sum<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>adder augend addend sum<span style="color: #268bd2;">)</span>
                   sum<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">c-</span> minuend subtrahend<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>with-connectors <span style="color: #268bd2;">(</span>difference<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>adder difference subtrahend minuend<span style="color: #268bd2;">)</span>
                   difference<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">c*</span> multiplicand m2<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>with-connectors <span style="color: #268bd2;">(</span>product<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>multiplier multiplicand  m2 product<span style="color: #268bd2;">)</span>
                   product<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">c/</span> dividend divisor<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>with-connectors <span style="color: #268bd2;">(</span>quotient<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>multiplier quotient divisor dividend<span style="color: #268bd2;">)</span>
                   quotient<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">cv</span> value<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>with-connectors <span style="color: #268bd2;">(</span>result<span style="color: #268bd2;">)</span>
                   <span style="color: #268bd2;">(</span>constant value result<span style="color: #268bd2;">)</span>
                   result<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbd00c50" class="outline-3">
<h3 id="orgbd00c50">Exercise 3.38</h3>
<div class="outline-text-3" id="text-orgbd00c50">
<blockquote>
<p>
Suppose that Peter, Paul, and Mary share a joint bank account that initially
contains $100. Concurrently, Peter deposits $10, Paul withdraws $20, and Mary
withdraws half the money in the account, by executing the following commands:
</p>

<p>
Peter: (set! balance (+ balance 10))
Paul:  (set! balance (- balance 20))
Mary:  (set! balance (- balance (/ balance 2)))
</p>

<ol class="org-ol">
<li>List all the different possible values for balance after these three
transactions have been completed, assuming that the banking system forces the
three processes to run sequentially in some order.</li>

<li>What are some other values that could be produced if the system allows the
processes to be interleaved? Draw timing diagrams like the one in Figure 3.29 to
explain how these values can occur.</li>
</ol>
</blockquote>
</div>
<div id="outline-container-org7745f48" class="outline-4">
<h4 id="org7745f48">Answer</h4>
<div class="outline-text-4" id="text-org7745f48">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Answer (1):</span>
<span style="color: #93a1a1;">Peter-&gt;Paul-&gt;Mary: (calc-eval "((100+10)-20)/2")       =&gt; 45</span>
<span style="color: #93a1a1;">Peter-&gt;Mary-&gt;Paul: (calc-eval "((100+10)/2)-20")       =&gt; 35</span>
<span style="color: #93a1a1;">Mary-&gt;Paul-&gt;Peter: (calc-eval "((100 / 2) - 20) + 20") =&gt; 50</span>
<span style="color: #93a1a1;">Mary-&gt;Peter-&gt;Paul: (calc-eval "((100 / 2) + 10) - 20") =&gt; 40</span>
<span style="color: #93a1a1;">Paul-&gt;Peter-&gt;Mary: (calc-eval "((100 - 20) + 10) / 2") =&gt; 45</span>
<span style="color: #93a1a1;">Paul-&gt;Mary-&gt;Peter: (calc-eval "((100 - 20) / 2) + 10") =&gt; 50</span>
<span style="color: #93a1a1;">|#</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc1845b3" class="outline-3">
<h3 id="orgc1845b3">Exercise 3.39</h3>
<div class="outline-text-3" id="text-orgc1845b3">
<blockquote>
<p>
Which of the five possibilities in the parallel execution shown above remain if
we instead serialize execution as follows:
</p>

<p>
(define x 10)
(define s (make-serializer))
(parallel-execute
(lambda ()
(set! x ((s (lambda () (* x x))))))
(s (lambda () (set! x (+ x 1)))))
</p>
</blockquote>
</div>
<div id="outline-container-org0478faf" class="outline-4">
<h4 id="org0478faf">Answer</h4>
<div class="outline-text-4" id="text-org0478faf">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">ANSWER: 101, 100, 121</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org49c7471" class="outline-3">
<h3 id="org49c7471">Exercise 3.40</h3>
<div class="outline-text-3" id="text-org49c7471">
<blockquote>
<p>
Give all possible values of x that can result from executing
</p>

<p>
(define x 10)
(parallel-execute
(lambda () (set! x (* x x)))
(lambda () (set! x (* x x x))))
</p>

<p>
Which of these possibilities remain if we instead use serialized procedures:
</p>

<p>
(define x 10)
(define s (make-serializer))
(parallel-execute
(s (lambda () (set! x (* x x))))
(s (lambda () (set! x (* x x x)))))
</p>
</blockquote>
</div>
<div id="outline-container-org18d9c5d" class="outline-4">
<h4 id="org18d9c5d">Answer</h4>
<div class="outline-text-4" id="text-org18d9c5d">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Answer: x*6 (multiplication is commutative)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a4e683" class="outline-3">
<h3 id="org7a4e683">Exercise 3.41</h3>
<div class="outline-text-3" id="text-org7a4e683">
<blockquote>
<p>
Ben Bitdiddle worries that it would be better to implement the bank account as
follows (where the commented line has been changed):
</p>

<p>
(define (make-account balance)
(define (withdraw amount)
(if (&gt;= balance amount)
(begin
(set! balance
(- balance amount))
balance)
"Insufficient funds"))
(define (deposit amount)
(set! balance (+ balance amount))
balance)
(let ((protected (make-serializer)))
(define (dispatch m)
(cond ((eq? m 'withdraw)
(protected withdraw))
((eq? m 'deposit)
(protected deposit))
((eq? m 'balance)
((protected
(lambda ()
balance)))) ; serialized
(else
(error
"Unknown request:
MAKE-ACCOUNT"
m))))
dispatch))
</p>

<p>
because allowing unserialized access to the bank balance can result in anomalous
behavior. Do you agree? Is there any scenario that demonstrates Ben’s concern?
</p>
</blockquote>
</div>
<div id="outline-container-org6a517c8" class="outline-4">
<h4 id="org6a517c8">Answer</h4>
<div class="outline-text-4" id="text-org6a517c8">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">First off, this question is phrased in a really shitty way. Second off, no</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">*BALANCE* is safe. the other functions are *UNSAFE*</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org40143c3" class="outline-3">
<h3 id="org40143c3">Exercise 3.42</h3>
<div class="outline-text-3" id="text-org40143c3">
<blockquote>
<p>
Ben Bitdiddle suggests that it’s a waste of time to create a new serialized
procedure in response to every withdraw and deposit message. He says that
make-account could be changed so that the calls to protected are done outside
the dispatch procedure. That is, an account would return the same serialized
procedure (which was created at the same time as the account) each time it is
asked for a withdrawal procedure.
</p>

<p>
(define (make-account balance)
(define (withdraw amount)
(if (&gt;= balance amount)
(begin (set! balance
(- balance amount))
balance)
"Insufficient funds"))
(define (deposit amount)
(set! balance (+ balance amount))
balance)
(let ((protected (make-serializer)))
(let ((protected-withdraw
(protected withdraw))
(protected-deposit
(protected deposit)))
(define (dispatch m)
(cond ((eq? m 'withdraw)
protected-withdraw)
((eq? m 'deposit)
protected-deposit)
((eq? m 'balance)
balance)
(else
(error "Unknown request:
MAKE-ACCOUNT"
m))))
dispatch)))
</p>
</blockquote>
</div>

<div id="outline-container-org0ee0a75" class="outline-4">
<h4 id="org0ee0a75">Answer</h4>
<div class="outline-text-4" id="text-org0ee0a75">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Answer: This is fine</span>
</pre>
</div>
</div>
</div>
</div>
