org/_posts/2019-06-23-sicp-chapter-3.org
** TODO Exercise 3.43
   #+begin_quote
   Suppose that the balances in three accounts start out as $10, $20, and $30,
   and that multiple processes run, exchanging the balances in the accounts.
   Argue that if the processes are run sequentially, after any number of
   concurrent exchanges, the account balances should be $10, $20, and $30 in
   some order. Draw a timing diagram like the one in *Note Figure 3-29:: to
   show how this condition can be violated if the exchanges are implemented
   using the first version of the account-exchange program in this section. On
   the other hand, argue that even with this `exchange' program, the sum of
   the balances in the accounts will be preserved. Draw a timing diagram to
   show how even this condition would be violated if we did not serialize the
   transactions on individual accounts. 
   #+end_quote
*** Answer
    #+begin_src scheme
#| SKIPPED: Timing diagram |#
    #+end_src

**  TODO Exercise 3.47
   #+begin_quote
    A semaphore (of size n ) is a generalization of a mutex. Like a mutex, a
    semaphore supports acquire and release operations, but it is more general in
    that up to n processes can acquire it concurrently. Additional processes that
    attempt to acquire the semaphore must wait for release operations. Give
    implementations of semaphores
    
    1. In terms of mutexes
    2. In terms of atomic test-and-set! operations.
   #+end_quote
