_posts/2019-06-23-sicp-chapter-3.html

<div id="outline-container-orge81cdb5" class="outline-3">
<h3 id="orge81cdb5"><span class="todo TODO">TODO</span> Exercise 3.43</h3>
<div class="outline-text-3" id="text-orge81cdb5">
<blockquote>
<p>
Suppose that the balances in three accounts start out as $10, $20, and $30,
and that multiple processes run, exchanging the balances in the accounts.
Argue that if the processes are run sequentially, after any number of
concurrent exchanges, the account balances should be $10, $20, and $30 in
some order. Draw a timing diagram like the one in *Note Figure 3-29:: to
show how this condition can be violated if the exchanges are implemented
using the first version of the account-exchange program in this section. On
the other hand, argue that even with this `exchange' program, the sum of
the balances in the accounts will be preserved. Draw a timing diagram to
show how even this condition would be violated if we did not serialize the
transactions on individual accounts. 
</p>
</blockquote>
</div>
<div id="outline-container-orgbb583e0" class="outline-4">
<h4 id="orgbb583e0">Answer</h4>
<div class="outline-text-4" id="text-orgbb583e0">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">#| SKIPPED: Timing diagram |#</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc976eb6" class="outline-3">
<h3 id="orgc976eb6"><span class="todo TODO">TODO</span> Exercise 3.47</h3>
<div class="outline-text-3" id="text-orgc976eb6">
<blockquote>
<p>
A semaphore (of size n ) is a generalization of a mutex. Like a mutex, a
semaphore supports acquire and release operations, but it is more general in
that up to n processes can acquire it concurrently. Additional processes that
attempt to acquire the semaphore must wait for release operations. Give
implementations of semaphores
</p>

<ol class="org-ol">
<li>In terms of mutexes</li>
<li>In terms of atomic test-and-set! operations.</li>
</ol>
</blockquote>
</div>
</div>
</section>
